apple-open-source/macos/IOUSBFamily/AppleUSBEHCI/Classes/AppleUSBEHCI.cpp
		_pEHCIRegisters->ConfigFlag = HostToUSBLong(kEHCIPortRoutingBit);  		// Route ports to EHCI
		IOSync();
		IOSleep(1);
		if (_errataBits & kErrataNECIncompleteWrite)
		{
			UInt32		newValue = 0, count = 0;
			newValue = USBToHostLong(_pEHCIRegisters->ConfigFlag);
			while ((count++ < 10) && (newValue != kEHCIPortRoutingBit))
			{
				USBError(1, "EHCI driver: UIMInitialize - ConfigFlag bit not sticking. Retrying.");
				_pEHCIRegisters->ConfigFlag = HostToUSBLong(kEHCIPortRoutingBit);
				IOSync();
				newValue = USBToHostLong(_pEHCIRegisters->ConfigFlag);
			}
		}
		
		_outSlot = kEHCIPeriodicListEntries+1;							// No Isoc transactions currently
		_frameNumber = 0;
        
        // 10186556 - don't do rMBS during Isoch if we are on TBolt
        if (!_v3ExpansionData->_onThunderbolt)
            _expansionData->_isochMaxBusStall = 25000;						// we need a requireMaxBusStall of 25 microseconds for EHCI (but not on Tbolt)

		// this is the "think time" needed for the controller to go from one QH to the next. It is used for periodic scheduling
		_controllerThinkTime = 100;
		
		if ((err = InterruptInitialize()))
			continue;

		CheckSleepCapability();

		gotTimerThreads = true;
		_rootHubNumPorts = USBToHostLong(_pEHCICapRegisters->HCSParams) & kEHCINumPortsMask;
		for (i=0; i < _rootHubNumPorts; i++)
		{
			_rhResumePortTimerThread[i] = thread_call_allocate((thread_call_func_t)RHResumePortTimerEntry, (thread_call_param_t)this);
			if (!_rhResumePortTimerThread[i])
			{
				gotTimerThreads = false;
				break;
			}
		}
		if (!gotTimerThreads)
			continue;
		
		
		_diagnostics = AppleUSBEHCIDiagnostics::createDiagnostics(this);
		if( _diagnostics )
		{
			setProperty( "Statistics", _diagnostics );
		}
		
		_uimInitialized = true;

		registerService();									// allows the UHCI driver to know we are here
		return kIOReturnSuccess;
		
    } while (false);
	
    USBError(1, "AppleUSBEHCI[%p]::UIMInitialize - Error occurred (0x%x)",  this, err);
    UIMFinalize();

    if (_filterInterruptSource)
		_filterInterruptSource->release();
	
    return(err);
}



#ifdef SUPPORTS_SS_USB
void
AppleUSBEHCI::CheckForSharedXHCIController(void)
{
	uint64_t                seconds = 10;
	const IORegistryPlane*	acpiPlane;
	IORegistryIterator*		iter;
	IORegistryEntry*		entry;
	UInt32					portnum = 0;
	IOACPIPlatformDevice*	acpiDevice;
    IOService *             xhciCandidate = NULL;
    IORegistryEntry *       xhciProvider = NULL;
    const char *            xhciProviderName = NULL;
    OSDictionary *          matchingDictionary = NULL;
    OSIterator *            xhciList = NULL;
	
	UInt32					assertVal	= 0;                    // this value is returned from the ACPI tables
    UInt32                  xhciBitmap = 0;                     // this value is a compilation of all of the matching XHCI we have found
    
	if ( !isInactive() )
	{	
        _xhciController = NULL;                 // just to make sure
        
        acpiDevice = CopyACPIDevice( _device );
        if (acpiDevice == NULL)
        {
            USBLog(3, "IOUSBController[%p]::CheckForSharedXHCIController acpiDevice not found", this);
            return;
        }
        
        IOReturn status = acpiDevice->evaluateInteger ( "XHCN", &assertVal );
        
        acpiDevice->release();
        acpiDevice = NULL;
        
        if (status != kIOReturnSuccess)
        {
            USBLog(3, "IOUSBController[%p]::CheckForSharedXHCIController XHCN method not found", this);
            return;
        }
        

        // since we have an XHCN method in our ACPI table, we know that we are MUXed with an XHCI controller
        // we will now wait for an AppleUSBXHCI driver to show up and verify that it's provider
        // matches the one to which we are MUXed
        matchingDictionary = serviceMatching("AppleUSBXHCI");                   // waitForMatchingServices does not consume this
        if (!matchingDictionary)
        {
            USBLog(3, "IOUSBController[%p]::CheckForSharedXHCIController could not get matching dictionary (very unusual)", this);
            return;
        }
        
        xhciCandidate = waitForMatchingService( matchingDictionary,  kSecondScale * seconds);           // we have a reference to this candidate

        if( !xhciCandidate )
        {
            USBError(1, "AppleUSBEHCI[%p]::CheckForSharedXHCIController could not discover AppleUSBXHCI in %lld secs", this, seconds);
            matchingDictionary->release();
            return;
        }
        
        USBLog(6, "AppleUSBEHCI[%p]::CheckForSharedXHCIController found AppleUSBXHCI %p", this, xhciCandidate);

        
        xhciProvider = xhciCandidate->getParentEntry(gIOServicePlane);
        xhciProviderName = xhciProvider->getName();
        
        // The name is a cstring which should be of the form "XHCn" where "n" is a digit from 1 to ??
        // The n is a bit position (1 is bit 0, 2 is bit 1) in the assertVal retrieved above
        
        if (strncmp(xhciProviderName, "XHC", 3) == 0)
        {
            char    myNum = xhciProviderName[3];
            int     val = myNum - '1';
            if ((val >=0) && (val < 10))
            {
                xhciBitmap |= (1 << val);
            }
        }
        
        // in the simple case, there is only one XHCn in the system, and we will match to it
        if ((xhciBitmap & assertVal) == assertVal)
        {
#if DEBUG_LEVEL != DEBUG_LEVEL_PRODUCTION
            uint64_t	ourObject = (uint64_t) xhciCandidate;
            setProperty("xhci", ourObject, 64);
#endif
            _xhciController = xhciCandidate;						// we still have the reference given to us
            _xhciController->retain();								// 10397671: retain this copy since we will need to release the other reference if this is not the correct one                
        }
        else
        {
            if ((xhciBitmap != 0) && (assertVal != 0))
            {
                USBError(1, "AppleUSBEHCI[%p]::CheckForSharedXHCIController - unable to find the correct XHCI xhciBitmap(0x%08x) assertVal(0x%08x)", this, (unsigned int)xhciBitmap, (unsigned int)assertVal);
            }
        }
        
